In [1]:
import seaborn as sn
import pandas as pd
import numpy as np
from datetime import datetime

In [2]:
dataframe = pd.read_csv("/content/train.csv")

In [3]:
dataframe.head()

,Unnamed: 0,Name,Location,Year,Kilometers_Driven,Fuel_Type,Transmission,Owner_Type,Mileage,Engine,Power,Seats,New_Price,Price
0,1,Hyundai Creta 1.6 CRDi SX Option,Pune,2015,41000,Diesel,Manual,First,19.67 kmpl,1582 CC,126.2 bhp,5.0,NaN,12.50
1,2,Honda Jazz V,Chennai,2011,46000,Petrol,Manual,First,13 km/kg,1199 CC,88.7 bhp,5.0,8.61 Lakh,4.50
2,3,Maruti Ertiga VDI,Chennai,2012,87000,Diesel,Manual,First,20.77 kmpl,1248 CC,88.76 bhp,7.0,NaN,6.00
3,4,Audi A4 New 2.0 TDI Multitronic,Coimbatore,2013,40670,Diesel,Automatic,Second,15.2 kmpl,1968 CC,140.8 bhp,5.0,NaN,17.74
4,6,Nissan Micra Diesel XV,Jaipur,2013,86999,Diesel,Manual,First,23.08 kmpl,1461 CC,63.1 bhp,5.0,NaN,3.50

In [4]:
len(dataframe)

5847

In [5]:
#a)  Look for the missing values in all the columns and either impute them (replace with mean, median, or mode) or drop them. Justify your action for this task.
dataframe.isnull().sum()

Unnamed: 0              0
Name                    0
Location                0
Year                    0
Kilometers_Driven       0
Fuel_Type               0
Transmission            0
Owner_Type              0
Mileage                 2
Engine                 36
Power                  36
Seats                  38
New_Price            5032
Price                   0
dtype: int64

In [6]:
#ensure the resulting DataFrame contains only complete cases without missing values,
dataframe=dataframe.dropna()

In [7]:
#No null values in the dataset

dataframe.isnull().sum()

Unnamed: 0           0
Name                 0
Location             0
Year                 0
Kilometers_Driven    0
Fuel_Type            0
Transmission         0
Owner_Type           0
Mileage              0
Engine               0
Power                0
Seats                0
New_Price            0
Price                0
dtype: int64

In [8]:
print(dataframe)

      Unnamed: 0                               Name Location  Year  \
1              2                       Honda Jazz V  Chennai  2011
5              7  Toyota Innova Crysta 2.8 GX AT 8S   Mumbai  2016
8             10                   Maruti Ciaz Zeta    Kochi  2018
13            15        Mitsubishi Pajero Sport 4X4    Delhi  2014
18            20                  BMW 3 Series 320d    Kochi  2014
...          ...                                ...      ...   ...
5827        5999              Tata Bolt Revotron XT  Chennai  2016
5830        6002      Volkswagen Vento 1.6 Highline   Mumbai  2011
5833        6005           Maruti Vitara Brezza VDi     Pune  2016
5838        6010               Honda Brio 1.2 VX MT    Delhi  2013
5842        6014                   Maruti Swift VDI    Delhi  2014

      Kilometers_Driven Fuel_Type Transmission Owner_Type     Mileage  \
1                 46000    Petrol       Manual      First    13 km/kg
5                 36000    Diesel    Automatic      First  11.36 kmpl
8                 25692    Petrol       Manual      First  21.56 kmpl
13               110000    Diesel       Manual      First   13.5 kmpl
18                32982    Diesel    Automatic      First  22.69 kmpl
...                 ...       ...          ...        ...         ...
5827              10000    Petrol       Manual      First  17.57 kmpl
5830              38000    Petrol       Manual      First  16.09 kmpl
5833              37208    Diesel       Manual      First   24.3 kmpl
5838              33746    Petrol       Manual      First   18.5 kmpl
5842              27365    Diesel       Manual      First   28.4 kmpl

       Engine       Power  Seats   New_Price  Price
1     1199 CC    88.7 bhp    5.0   8.61 Lakh   4.50
5     2755 CC   171.5 bhp    8.0     21 Lakh  17.50
8     1462 CC  103.25 bhp    5.0  10.65 Lakh   9.95
13    2477 CC  175.56 bhp    7.0  32.01 Lakh  15.00
18    1995 CC     190 bhp    5.0  47.87 Lakh  18.55
...       ...         ...    ...         ...    ...
5827  1193 CC    88.7 bhp    5.0   7.77 Lakh   4.00
5830  1598 CC   103.5 bhp    5.0  11.91 Lakh   3.25
5833  1248 CC    88.5 bhp    5.0   9.93 Lakh   7.43
5838  1198 CC    86.8 bhp    5.0   6.63 Lakh   3.20
5842  1248 CC      74 bhp    5.0   7.88 Lakh   4.75

[814 rows x 14 columns]

In [9]:
#b) Remove the units from some of the attributes and only keep the numerical values (for example remove kmpl from “Mileage”, CC from “Engine”, bhp from “Power”, and lakh from “New_price”).
def numeric(value):
    if pd.isnull(value):
        return None  # Just in case there are NaN values in your data
    numeric_part = ''.join(filter(str.isdigit, value))
    return int(numeric_part) if numeric_part.isdigit() else None

In [10]:
dataframe['Mileage']=dataframe['Mileage'].apply(numeric)

In [11]:
print(dataframe)

      Unnamed: 0                               Name Location  Year  \
1              2                       Honda Jazz V  Chennai  2011
5              7  Toyota Innova Crysta 2.8 GX AT 8S   Mumbai  2016
8             10                   Maruti Ciaz Zeta    Kochi  2018
13            15        Mitsubishi Pajero Sport 4X4    Delhi  2014
18            20                  BMW 3 Series 320d    Kochi  2014
...          ...                                ...      ...   ...
5827        5999              Tata Bolt Revotron XT  Chennai  2016
5830        6002      Volkswagen Vento 1.6 Highline   Mumbai  2011
5833        6005           Maruti Vitara Brezza VDi     Pune  2016
5838        6010               Honda Brio 1.2 VX MT    Delhi  2013
5842        6014                   Maruti Swift VDI    Delhi  2014

      Kilometers_Driven Fuel_Type Transmission Owner_Type  Mileage   Engine  \
1                 46000    Petrol       Manual      First       13  1199 CC
5                 36000    Diesel    Automatic      First     1136  2755 CC
8                 25692    Petrol       Manual      First     2156  1462 CC
13               110000    Diesel       Manual      First      135  2477 CC
18                32982    Diesel    Automatic      First     2269  1995 CC
...                 ...       ...          ...        ...      ...      ...
5827              10000    Petrol       Manual      First     1757  1193 CC
5830              38000    Petrol       Manual      First     1609  1598 CC
5833              37208    Diesel       Manual      First      243  1248 CC
5838              33746    Petrol       Manual      First      185  1198 CC
5842              27365    Diesel       Manual      First      284  1248 CC

           Power  Seats   New_Price  Price
1       88.7 bhp    5.0   8.61 Lakh   4.50
5      171.5 bhp    8.0     21 Lakh  17.50
8     103.25 bhp    5.0  10.65 Lakh   9.95
13    175.56 bhp    7.0  32.01 Lakh  15.00
18       190 bhp    5.0  47.87 Lakh  18.55
...          ...    ...         ...    ...
5827    88.7 bhp    5.0   7.77 Lakh   4.00
5830   103.5 bhp    5.0  11.91 Lakh   3.25
5833    88.5 bhp    5.0   9.93 Lakh   7.43
5838    86.8 bhp    5.0   6.63 Lakh   3.20
5842      74 bhp    5.0   7.88 Lakh   4.75

[814 rows x 14 columns]

In [12]:
dataframe['Power']=dataframe['Power'].apply(numeric)

In [13]:
dataframe['Engine']=dataframe['Engine'].apply(numeric)

In [14]:
dataframe['New_Price']=dataframe['New_Price'].apply(numeric)

In [15]:
print(dataframe)

      Unnamed: 0                               Name Location  Year  \
1              2                       Honda Jazz V  Chennai  2011
5              7  Toyota Innova Crysta 2.8 GX AT 8S   Mumbai  2016
8             10                   Maruti Ciaz Zeta    Kochi  2018
13            15        Mitsubishi Pajero Sport 4X4    Delhi  2014
18            20                  BMW 3 Series 320d    Kochi  2014
...          ...                                ...      ...   ...
5827        5999              Tata Bolt Revotron XT  Chennai  2016
5830        6002      Volkswagen Vento 1.6 Highline   Mumbai  2011
5833        6005           Maruti Vitara Brezza VDi     Pune  2016
5838        6010               Honda Brio 1.2 VX MT    Delhi  2013
5842        6014                   Maruti Swift VDI    Delhi  2014

      Kilometers_Driven Fuel_Type Transmission Owner_Type  Mileage  Engine  \
1                 46000    Petrol       Manual      First       13    1199
5                 36000    Diesel    Automatic      First     1136    2755
8                 25692    Petrol       Manual      First     2156    1462
13               110000    Diesel       Manual      First      135    2477
18                32982    Diesel    Automatic      First     2269    1995
...                 ...       ...          ...        ...      ...     ...
5827              10000    Petrol       Manual      First     1757    1193
5830              38000    Petrol       Manual      First     1609    1598
5833              37208    Diesel       Manual      First      243    1248
5838              33746    Petrol       Manual      First      185    1198
5842              27365    Diesel       Manual      First      284    1248

      Power  Seats  New_Price  Price
1       887    5.0        861   4.50
5      1715    8.0         21  17.50
8     10325    5.0       1065   9.95
13    17556    7.0       3201  15.00
18      190    5.0       4787  18.55
...     ...    ...        ...    ...
5827    887    5.0        777   4.00
5830   1035    5.0       1191   3.25
5833    885    5.0        993   7.43
5838    868    5.0        663   3.20
5842     74    5.0        788   4.75

[814 rows x 14 columns]

In [16]:
#C) Change the categorical variables (“Fuel_Type” and “Transmission”) into numerical one hot encoded value.  (5 points).
dataframe=pd.get_dummies(dataframe,columns=['Fuel_Type','Transmission'])
print(dataframe)

      Unnamed: 0                               Name Location  Year  \
1              2                       Honda Jazz V  Chennai  2011
5              7  Toyota Innova Crysta 2.8 GX AT 8S   Mumbai  2016
8             10                   Maruti Ciaz Zeta    Kochi  2018
13            15        Mitsubishi Pajero Sport 4X4    Delhi  2014
18            20                  BMW 3 Series 320d    Kochi  2014
...          ...                                ...      ...   ...
5827        5999              Tata Bolt Revotron XT  Chennai  2016
5830        6002      Volkswagen Vento 1.6 Highline   Mumbai  2011
5833        6005           Maruti Vitara Brezza VDi     Pune  2016
5838        6010               Honda Brio 1.2 VX MT    Delhi  2013
5842        6014                   Maruti Swift VDI    Delhi  2014

      Kilometers_Driven Owner_Type  Mileage  Engine  Power  Seats  New_Price  \
1                 46000      First       13    1199    887    5.0        861
5                 36000      First     1136    2755   1715    8.0         21
8                 25692      First     2156    1462  10325    5.0       1065
13               110000      First      135    2477  17556    7.0       3201
18                32982      First     2269    1995    190    5.0       4787
...                 ...        ...      ...     ...    ...    ...        ...
5827              10000      First     1757    1193    887    5.0        777
5830              38000      First     1609    1598   1035    5.0       1191
5833              37208      First      243    1248    885    5.0        993
5838              33746      First      185    1198    868    5.0        663
5842              27365      First      284    1248     74    5.0        788

      Price  Fuel_Type_Diesel  Fuel_Type_Petrol  Transmission_Automatic  \
1      4.50                 0                 1                       0
5     17.50                 1                 0                       1
8      9.95                 0                 1                       0
13    15.00                 1                 0                       0
18    18.55                 1                 0                       1
...     ...               ...               ...                     ...
5827   4.00                 0                 1                       0
5830   3.25                 0                 1                       0
5833   7.43                 1                 0                       0
5838   3.20                 0                 1                       0
5842   4.75                 1                 0                       0

      Transmission_Manual
1                       1
5                       0
8                       1
13                      1
18                      0
...                   ...
5827                    1
5830                    1
5833                    1
5838                    1
5842                    1

[814 rows x 16 columns]

In [17]:
#d) Create one more feature and add this column to the dataset (you can use mutate function in R for this). For example, you can calculate the current age of the car by subtracting “Year” value from the current year.   (
current_year = datetime.now().year
dataframe['Car_Age'] = current_year - dataframe['Year']

In [18]:
print(dataframe)

      Unnamed: 0                               Name Location  Year  \
1              2                       Honda Jazz V  Chennai  2011
5              7  Toyota Innova Crysta 2.8 GX AT 8S   Mumbai  2016
8             10                   Maruti Ciaz Zeta    Kochi  2018
13            15        Mitsubishi Pajero Sport 4X4    Delhi  2014
18            20                  BMW 3 Series 320d    Kochi  2014
...          ...                                ...      ...   ...
5827        5999              Tata Bolt Revotron XT  Chennai  2016
5830        6002      Volkswagen Vento 1.6 Highline   Mumbai  2011
5833        6005           Maruti Vitara Brezza VDi     Pune  2016
5838        6010               Honda Brio 1.2 VX MT    Delhi  2013
5842        6014                   Maruti Swift VDI    Delhi  2014

      Kilometers_Driven Owner_Type  Mileage  Engine  Power  Seats  New_Price  \
1                 46000      First       13    1199    887    5.0        861
5                 36000      First     1136    2755   1715    8.0         21
8                 25692      First     2156    1462  10325    5.0       1065
13               110000      First      135    2477  17556    7.0       3201
18                32982      First     2269    1995    190    5.0       4787
...                 ...        ...      ...     ...    ...    ...        ...
5827              10000      First     1757    1193    887    5.0        777
5830              38000      First     1609    1598   1035    5.0       1191
5833              37208      First      243    1248    885    5.0        993
5838              33746      First      185    1198    868    5.0        663
5842              27365      First      284    1248     74    5.0        788

      Price  Fuel_Type_Diesel  Fuel_Type_Petrol  Transmission_Automatic  \
1      4.50                 0                 1                       0
5     17.50                 1                 0                       1
8      9.95                 0                 1                       0
13    15.00                 1                 0                       0
18    18.55                 1                 0                       1
...     ...               ...               ...                     ...
5827   4.00                 0                 1                       0
5830   3.25                 0                 1                       0
5833   7.43                 1                 0                       0
5838   3.20                 0                 1                       0
5842   4.75                 1                 0                       0

      Transmission_Manual  Car_Age
1                       1       12
5                       0        7
8                       1        5
13                      1        9
18                      0        9
...                   ...      ...
5827                    1        7
5830                    1       12
5833                    1        7
5838                    1       10
5842                    1        9

[814 rows x 17 columns]

In [19]:
dataframe.to_csv('result.csv')